# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      ~ kubernetes_version                  = "1.30" -> "1.31"
        name                                = "admin-test-aks"
        tags                                = {}
        # (34 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "syspool"
          ~ orchestrator_version          = "1.30" -> "1.31"
            tags                          = {}
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.workpool will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "workpool" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks/agentPools/workpool"
        name                          = "workpool"
      ~ orchestrator_version          = "1.30" -> "1.31"
        tags                          = {}
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aks.azurerm_resource_group.dis will be created
  + resource "azurerm_resource_group" "dis" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "DIS_admin-test_main-rg"
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be updated in-place
  ~ resource "azurerm_key_vault" "obs_kv" {
        id                              = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-obs-rg/providers/Microsoft.KeyVault/vaults/obs-admin-test-cayvkP"
        name                            = "obs-admin-test-cayvkP"
        tags                            = {}
      ~ tenant_id                       = (sensitive value)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role must be replaced
-/+ resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-obs-rg/providers/Microsoft.KeyVault/vaults/obs-admin-test-cayvkP/providers/Microsoft.Authorization/roleAssignments/dc93297a-5c47-51a9-21e1-bfe26ceca423" -> (known after apply)
      ~ name                                   = "dc93297a-5c47-51a9-21e1-bfe26ceca423" -> (known after apply)
      ~ principal_id                           = "02b17d28-7ec8-4084-92ce-d26051fa4998" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`